In [30]:
get_ipython().system('pip install -q psycopg2')

In [31]:
import pandas as pd
import psycopg2 as pg
from sqlalchemy import create_engine

In [32]:
engine = create_engine('postgresql://postgres:0808@localhost/Aula16')

In [33]:
query = 'SELECT * FROM cliente'
df = pd.read_sql(query, engine, index_col='cli_id')
df

         cli_nome    cli_endereco
cli_id
1       Nikherson      Lá em casa
2            Abel  Ruazinha braba
3          Giulia           Venus
4       Guilherme     Longe daqui

In [34]:
query = 'SELECT * FROM livro'
df = pd.read_sql(query, engine, index_col='liv_id')
df

                liv_titulo liv_isbn
liv_id
1         O Pequeno Sereio   OBC123
2       O limite do amanhã    4AB5E
3          Procurando Nemo  NeMo321
4                   Livro4    isbn4

In [35]:
query = 'SELECT * FROM venda'
df = pd.read_sql(query, engine, index_col='ven_id')
df

Empty DataFrame
Columns: [ven_frete, ven_valor, cli_id, liv_id]
Index: []

In [36]:
conn = pg.connect(database = 'Aula16',
                 user='postgres',
                 password='0808')

In [37]:
cursor = conn.cursor()

### Cliente

In [9]:
cli_nome = input("Nome: ")
cli_endereco = input("Endereço: ")
cursor.execute(f"INSERT INTO cliente (cli_nome, cli_endereco) values ('{cli_nome}', '{cli_endereco}')")
conn.commit()

Nome: Guilherme
Endereço: Longe daqui

In [26]:
query = 'SELECT * FROM cliente'
df = pd.read_sql(query, engine, index_col='cli_id')
df

         cli_nome    cli_endereco
cli_id
1       Nikherson      Lá em casa
2            Abel  Ruazinha braba
3          Giulia           Venus
4       Guilherme     Longe daqui

### Livro

In [11]:
liv_titulo = input("Titulo: ")
liv_ISBN = input("ISBN: ")
cursor.execute(f"INSERT INTO livro (liv_titulo, liv_isbn) values ('{liv_titulo}','{liv_ISBN}')")
conn.commit()

Titulo: Livro4
ISBN: isbn4

In [27]:
query = 'SELECT * FROM livro'
df = pd.read_sql(query, engine, index_col='liv_id')
df

                liv_titulo liv_isbn
liv_id
1         O Pequeno Sereio   OBC123
2       O limite do amanhã    4AB5E
3          Procurando Nemo  NeMo321
4                   Livro4    isbn4

### Vendas

In [38]:
ven_frete = input("Valor do Frete: ")
ven_valor = input("Total: ")
cli_nome = input("Nome do cliente: ")
liv_titulo = input("Titulo do livro: ")

id_cliente = f"SELECT cli_id FROM cliente WHERE cli_nome = '{cli_nome}'"
df_cliente = pd.read_sql(id_cliente, engine)
cli_id = df_cliente.get("cli_id").iloc[0]

id_livro = f"SELECT liv_id FROM livro WHERE liv_titulo = '{liv_titulo}'"
df_livro = pd.read_sql(id_livro, engine)
liv_id = df_livro.get("liv_id").iloc[0]

cursor.execute(f"INSERT INTO venda (ven_frete, ven_valor, cli_id, liv_id) VALUES ({ven_frete},{ven_valor},{cli_id},{liv_id})")
conn.commit()

Valor do Frete: 12.5
Total: 25.5
Nome do cliente: Giulia
Titulo do livro: Livro4

In [39]:
query = 'SELECT * FROM venda'
df = pd.read_sql(query, engine)
df

   ven_id  ven_frete  ven_valor  cli_id  liv_id
0       1       12.5         26       3       4